/****************************************************************************/
/*  TR CODE : BAQ90003 (공인인증 인증비밀 번호 오류횟수)                    */
/****************************************************************************/
typedef struct  _BAQ90003_IN{
    char    userid [ 8];        /* 사용자 ID                                */
    char    cust_no[16];        /* 주민번호, 사업자번호                     */
    char    gubun  [ 1];        /* 'Y' : 오류횟수초기화, 'N': 오류횟수 증가 */
} BAQ90003_IN;

typedef struct  _BAQ90003_OUT{
    char    dspwfailcount[3]; /* 전자인증 비밀번호 오류 횟수      */
} BAQ90003_OUT;
