/****************************************************************************/
/*  TR CODE : BAQ90002 (공인인증 인증서 검증)                               */
/****************************************************************************/
typedef struct {
    char    cust_type   [1];        /* '1':개인, '2': 법인      */
    char    userid      [8];        /* 사용자 ID               */
    char    cust_no     [16];       /* 주민번호, 사업자번호      */
    char    dn          [256];      /* DN                   */
    char    authlen     [4];        /* "원문+서명+인증서"의 길이  */
    char    loginauth   [3000];     /* "원문+서명+인증서"                       */
    /* (원문(10:UserId)+인증서(1.2K)+서명(128)) * 1.8 (PEM변환시) => 약 2500 ==> 3000으로 정의 */
} BAQ90002_IN;

typedef struct {
    char    certusestate    [1];    /* 로그인검증 사용 상태  */
    /* 'Y':정상, 뒤에 공개키 내려감
     'N':검증시 오류발생
     'R':등록되지 않은 인증서 */
    char    publickey       [300];  /* 공개키 (인증서에서 추출) */
    /* Binary(fnpro) :140Byte */
    /* Base64(fn.com):252Byte(최대) */
} BAQ90002_OUT;

